'use strict';
const { Category } = require("../../_default/model");

const categories = [
    "دفاع مقدس",
    "شهدا",
    "مقاومت",
    "تجهیزات نظامی",
    "نظامی",
    "انقلاب اسلامی",
    "مذهبی",
    "شخصیت ها",
    "چهره ها",
    "مردم",
    "اجتماع مردمی",
    "زنان",
    "آداب و رسوم",
    "سخنرانی",
    "مصاحبه",
    'گزارش خبری',
    "غذا و نوشیدنی",
    "مواد غذایی",
    "آشپزی",
    "خانواده",
    "سبک زندگی",
    "تفریح و سرگرمی",
    "آموزش",
    "طبیعت",
    "حیوانات",
    "محیط زیست",
    "وسائل نقلیه",
    "حمل و نقل",
    "جاده",
    "ترافیک",
    "حوادث",
    "امدادرسانی",
    "اماکن",
    "آثار باستانی",
    "تاریخی",
    "محیطی",
    "تبلیغات",
    "روستا",
    "نمای شهری",
    "تزئینات شهری",
    "ساختمان",
    "معماری",
    "هنر",
    "صنایع دستی",
    "گرافیک",
    "اقتصاد",
    "سیاسی",
    "ورزشی",
    "مشاغل",
    "کشاورزی و دامداری",
    "صنعت",
    "ماشین آلات صنعتی",
    "ابزارآلات",
    "علم و فناوری",
    "پزشکی و سلامت",
    "فیلم",
    "بازسازی",
    "تاریخ نگاری",
    "اشیا",
    "وقایع تاریخی",
    "جنگ",
    "متفرقه",
];



module.exports = {
    async up() {

        for (let i = 0; i < categories.length; i++) {
            try {
                await Category.findOrCreate({ where: { name: categories[i] } })
            }
            catch (err) {
                console.log(err)
            }
        }
    },
    async down() {

    }
};